In [15]:
import pandas as pd
import numpy as np

In [2]:
# Creation of dataframes in pandas
data={"salary":[1000,2000,3000],
      "Age":[12,23,34]}
df=pd.DataFrame(data)
df

   salary  Age
0    1000   12
1    2000   23
2    3000   34

In [ ]:
# For datasets
data=pd.read_csv("titanic.csv")
data

In [ ]:
# Exploring data in pandas  
    # we have to know the complete knowledge regarding data(null val,num val,datatype)
data=pd.read_csv("titanic.csv")
data.info()
data.describe()
data.isnull().sum()

In [ ]:
#Handling Duplicate value in pandas
data=pd.read_csv("titanic.csv")
data.duplicated()
data['last'].duplicated().sum()

# we have to remove the duplicated values from there where we have unique values 

data.drop_duplicates("age")

In [ ]:
#Working with Missing values in Data
data=pd.read_csv("titanic.csv")
data.isnull().sum()
data.dropna()  # here if we do this then we cat see the record because it deletes all the record of user
data.replace(np.nan,"hi") #but it will replace all an with hi so we have to do this
print(data["age"].mean()) #so here we take the mean of age and now we will replace it with the nan value
data["age"]=data["age"].replace(np.nan,29.69)
data